#!/usr/bin/env python3

# Колесо: длины, мм
l1 = 50
l2 = 50
l3 = 90
l4 = 50
d1 = 200

# Участки, мм
a = l4/2 + l3/2
b = a
c = l2/2
d = d1/2

# Силы, Н
Ft = 2890
Fr = 1052
Fa = 397

#----------------------------------------
# Вертикальная плоскость: XY

#-----------1. Реакции--------------------
# Моменты: положительно = против часовой стрелки

# ∑M(A) = 0
# -Fr*a + Fa*d + Rb*(a + b) = 0
Rb = (Fr*a - Fa*d)/(a + b)

# ∑M(B) = 0
# -Ra*(a + b) + Fr*b + Fa*d = 0
Ra = (Fr*b + Fa*d)/(a + b)

# Проверка ось Y
# Ra + Rb - Fr = 0
assert Ra + Rb - Fr == 0, 'Сумма сил должна быть равна нулю'

# Вывод результата
print("\n1.Расчет реакции опор")
print("Вертикальная плоскость: XY")
print(f"Момент Fa*d = {Fa*d} Н·мм")
print("Ось Y")
print(f"Ra = {Ra:.3f}")
print(f"Rb = {Rb:.3f}\n")


#-------------2. Эпюры--------------------
# Силы: положительно = балка крутится
# по часовой стрелке
# 
# Моменты: положительно = балка хочет изогнуться
# вверх

# 1.Участок 0 ≤ x ≤ a
# x = a
Ma = Ra * a

# Вывод результата
print("\n2.Построение эпюр")
print("Вертикальная плоскость: XY")
print("1.Участок 0 ≤ x ≤ a")
print("x = 0: Миy = 0")
print(f"x = a: Миy = {Ma:.1f}\n")


# 2.Участок a ≤ x ≤ (a + b)
# x = a
Ma = Ra * a - Fa * d
# x = a + b
Mb = Ra*(a + b) - Fa * d - Fr * b

# Вывод результата
print("2.Участок a ≤ x ≤ (a + b)")
print(f"x = a: Миy = {Ma:.1f}")
print(f"x = a+b: Миy = {Mb:.1f}\n")
print("--------------------------------------------------\n")


#----------------------------------------
# Горизонтальная плоскость: XZ

#-----------1. Реакции--------------------
# Моменты: положительно = против часовой стрелки

# ∑M(A) = 0
# -Ft*a + Rb*(a + b) = 0
Rb = Ft*a/(a + b)

# ∑M(B) = 0
# -Ra*(a + b) + Ft*b = 0
Ra = Ft*b/(a + b)

# Проверка ось Z
# Ra - Ft + Rb + Fm = 0 
assert Ra - Ft + Rb == 0 , 'Сумма сил должна быть равна нулю'

# Вывод результата
print("1.Расчет реакции опор")
print("Горизонтальная плоскость: XZ")
print("Ось Z")
print(f"Ra = {Ra:.3f}")
print(f"Rb = {Rb:.3f}\n")


#-------------2. Эпюры--------------------
# Силы: положительно = балка крутится
# по часовой стрелке
# 
# Моменты: положительно = балка хочет изогнуться
# вверх

# 1.Участок 0 ≤ x ≤ a
# x = a
Ma = Ra * a

# Вывод результата
print("\n2.Построение эпюр")
print("Горизонтальная плоскость: XZ\n")
print("1.Участок 0 ≤ x ≤ a")
print("x = 0: Миy = 0")
print(f"x = a: Миy = {Ma:.1f}\n")

# 2.Участок a ≤ x ≤ (a + b)
# x = a
Ma = Ra * a
# x = a + b
Mb = Ra * (a + b) - Ft * b

# Вывод результата
print("2.Участок a ≤ x ≤ (a + b)")
print(f"x = a: Миy = {Ma:.1f}")
print(f"x = a+b: Миy = {Mb:.1f}\n")

