#!/usr/bin/env python3

# Червяк: длины, мм
l1 = 50
l2 = 50
l3 = 240
l4 = 50
d1 = 50

# Участки, мм
a = l4/2 + l3/2
b = a
c = l2/2
d = d1/2

# Силы, Н
Ft = 397
Fr = 1052
Fa = 2890
Fm = 398

#--------------------Реакции--------------------
# Моменты: положительно = против часовой стрелки

# Вертикальная плоскость: XY
# ∑M(A) = 0
# -Fr*a - Fa*d + Rb*(a + b) = 0
Rb = (Fr*a + Fa*d)/(a + b)

# ∑M(B) = 0
# -Ra*(a + b) + Fr*b - Fa*d = 0
Ra = (Fr*b - Fa*d)/(a + b)

# Проверка ось Y
# Ra + Rb - Fr = 0
assert Ra + Rb - Fr == 0, 'Сумма сил должна быть равна нулю'

# Вывод результата
print("\n1.Расчет реакции опор")
print("Вертикальная плоскость: XY")
print(f"Момент Fa*d = {Fa*d} Н·мм")
print("Ось Y")
print(f"Ra = {Ra}")
print(f"Rb = {Rb}\n")


# Горизонтальная плоскость: XZ
# ∑M(A) = 0
# -Ft*a + Rb*(a + b) + Fm*(a + b + c) = 0
Rb = (Ft*a - Fm*(a + b + c))/(a + b)

# ∑M(B) = 0
# -Ra*(a + b) + Ft*b + Fm*c = 0
Ra = (Ft*b + Fm*c)/(a + b)

# Проверка ось Z
# Ra - Ft + Rb + Fm = 0 
assert Ra - Ft + Rb + Fm == 0 , 'Сумма сил должна быть равна нулю'

# Вывод результата
print("Горизонтальная плоскость: ZY")
print("Ось Z")
print(f"Ra = {Ra}")
print(f"Rb = {Rb}\n")
