#!/usr/bin/env python3

# Червяк: длины, мм
l1 = 50
l2 = 50
l3 = 240
l4 = 50
d1 = 50

# Участки, мм
a = l4/2 + l3/2
b = a
c = l2/2
d = d1/2

# Силы, Н
Ft = 397
Fr = 1052
Fa = 2890
Fm = 398

#--------------------Реакции--------------------
# Моменты: положительно = против часовой стрелки

# Вертикальная плоскость: XY
# ∑M(A) = 0
# -Fr*a - Fa*d + Rby*(a + b) = 0
Rby = (Fr*a + Fa*d)/(a + b)

# ∑M(B) = 0
# -Ray*(a + b) + Fr*b - Fa*d = 0
Ray = (Fr*b - Fa*d)/(a + b)

# Проверка ось Y
# Ray + Rby - Fr = 0
assert Ray + Rby - Fr == 0, 'Сумма сил должна быть равна нулю'

# Вывод результата
print("\n1.Расчет реакции опор")
print("Вертикальная плоскость: XY")
print(f"Момент Fa*d = {Fa*d} Н·мм")
print("Ось Y")
print(f"Ray = {Ray:.3f}")
print(f"Rby = {Rby:.3f}\n")


# Горизонтальная плоскость: XZ
# ∑M(A) = 0
# -Ft*a + Rbz*(a + b) + Fm*(a + b + c) = 0
Rbz = (Ft*a - Fm*(a + b + c))/(a + b)

# ∑M(B) = 0
# -Raz*(a + b) + Ft*b + Fm*c = 0
Raz = (Ft*b + Fm*c)/(a + b)

# Проверка ось Z
# Raz - Ft + Rbz + Fm = 0 
assert Raz - Ft + Rbz + Fm == 0 , 'Сумма сил должна быть равна нулю'

# Вывод результата
print("Горизонтальная плоскость: ZY")
print("Ось Z")
print(f"Raz = {Raz:.3f}")
print(f"Rbz = {Rbz:.3f}\n")


#--------------------Эпюры--------------------
# Силы: положительно = балка крутится
# по часовой стрелке
# 
# Моменты: положительно = балка хочет изогнуться
# вверх

# Вертикальная плоскость: XY
# 1.Участок 0 ≤ x ≤ a
# x = a
Ma = Ray * a

# Вывод результата
print("\n2.Построение эпюр")
print("Вертикальная плоскость: XY\n")
print("1.Участок 0 ≤ x ≤ a")
print("x = 0: Миy = 0")
print(f"x = a: Миy = {Ma:.1f}\n")


# 2.Участок a ≤ x ≤ (a + b)
# x = a
Ma = Ray * a + Fa * d
# x = a + b
Mb = Ray * (a + b) + Fa * d - Fr * b

# Вывод результата
print("2.Участок a ≤ x ≤ (a + b)")
print(f"x = a: Миy = {Ma:.1f}")
print(f"x = a+b: Миy = {Mb:.1f}\n")
